[
  {
    "id": 1,
    "category": "Software & Data Engineering",
    "imgSrc": "/tech-projects/MachineLearningInProduction.png",
    "imgSrcModal": "/tech-projects/MachineLearningInProduction.png",
    "title": "Machine Learning in Production (CMU 17-445)",
    "projectLink": "https://github.com/BryanTJJ99/ML-In-Production",
    "description": "End-to-end development of machine learning applications, including production testing, deployment pipelines, and robust data infrastructure for model learning and serving.",
    "icons": ["SiApachekafka", "FaDocker", "FaFlask", "SiGrafana", "SiApacheairflow"]
  },
  {
    "id": 2,
    "category": "Software & Data Engineering",
    "imgSrc": "/tech-projects/BigData.png",
    "title": "Big Data Architecture",
    "projectLink": "",
    "description": "This project aimed to address the challenge of consolidating disparate data sources in Singapore's commercial property landscape, which lacked a unified source of truth. By collaborating with PropertyGuru, we designed and implemented a sustainable data architecture that accurately aggregates data from various sources. This architecture supports the generation of actionable insights, tailored for shopping mall tenants and PropertyGuru stakeholders.",
    "icons": ["SiAwsamplify", "SiAmazonredshift", "SiAmazoncomprehend", "SiAmazons3", "SiAwslambda", "SiGooglecloudstorage", "SiGooglebigquery"]
  },
  {
    "id": 3,
    "category": "Software & Data Engineering",
    "imgSrc": "/tech-projects/BlackGold.png",
    "title": "Web Application Development - Community Composting",
    "projectLink": "https://github.com/Noreht/wad2_project",
    "description": "Built a frontend webpage titled BlackGold, which is a platform that aims to organically create composting communities across different apartments and regions in Singapore",
    "icons": ["FaVuejs","SiTailwindcss","FaNodeJs"]
  },
  {
    "id": 4,
    "category": "Software & Data Engineering",
    "imgSrc": "/tech-projects/OOP.png",
    "title": "Object Oriented Programming - Corporate Form Application",
    "projectLink": "https://github.com/BryanTJJ99/OOP_FormApp",
    "description": "Created a CRUD form application for a sponsoring client using Springboot for the backend and React for the frontend. The application is designed to manage corporate forms and their respective data.",
    "icons": ["SiSpringboot", "FaReact", "SiMongodb"]
  },
  {
    "id": 5,
    "category": "Software & Data Engineering",
    "imgSrc": "/tech-projects/ESD.png",
    "title": "Microservices Architecture - SecondChance Recycling System",
    "projectLink": "",
    "description": "Built a full-stack app using microservices architecture. Titled SecondChance, the resource management platform aims to track and reuse existing resources, reducing costs and promoting circular economy while quantifying carbon emissions reduction.",
    "icons": ["FaDocker", "FaFlask", "SiRabbitmq", "FaVuejs", "SiMongodb"]
  },
  {
    "id": 6,
    "category": "Innovation & Product Management",
    "imgSrc": "/tech-projects/SPM.png",
    "title": "Software Product Management",
    "projectLink": "https://drive.google.com/file/d/1_kjXlMKVkDwBME-4inrP1TZw24OA9hRz/view?usp=sharing",
    "description": "The project involved applying Software Project Management principles and techniques, with a focus on Agile Methods for software development. The work encompassed popular Agile frameworks such as Scrum, and utilized techniques like Pair Programming, C4 architecture, Test-Driven Development (TDD), Code Refactoring, and Continuous Integration (CI). The project team developed a web application that integrated data analytics, effectively combining software development and project management skills in a collaborative environment.",
    "icons": ["SiJira", "SiScrumalliance", "SiGithubactions", "FaGit"]
  },
  {
    "id": 7,
    "category": "Software & Data Engineering",
    "imgSrc": "/tech-projects/GIS.png",
    "title": "Geographical Information System - Satellite Land Cover Change Detection",
    "projectLink": "https://urbansensingjld.netlify.app/",
    "description": "Analysed land cover change in green spaces in Singapore’s Jurong Lake District using Sentinel-2 data, and recommend suitable strategies to reduce forested land loss.",
    "icons": ["SiQgis", "SiRstudio", "SiMysql"]
  },
  {
    "id": 8,
    "category": "Innovation & Product Management",
    "imgSrc": "/tech-projects/DBTT.png",
    "title": "Digital Business Technologies and Transformation",
    "projectLink": "https://drive.google.com/file/d/1Dk9R2X2ENyDb1wvrY_6nU3GL0kXGMRle/view?usp=sharing",
    "description": "This project, undertaken in the 'Digital Business Technology and Transformation' course, aimed to digitally transform a STEM-toy company by applying key frameworks and tools such as Porter’s Five Forces and the Business Model Canvas. The project included a thorough situational analysis to identify strategic challenges like limited product offerings and customer retention issues. A new digital strategy was developed, integrating a mobile application that combined physical STEM toys with interactive educational content to enhance customer engagement. Additionally, the project leveraged data analytics and predictive modeling to personalize the user experience and optimize business outcomes, providing a comprehensive roadmap for the company’s digital evolution.",
    "icons": []
  },
    {
    "id": 9,
    "category": "Innovation & Product Management",
    "imgSrc": "/tech-projects/BPAS.png",
    "title": "Business Process Analysis and Solutioning",
    "projectLink": "https://drive.google.com/file/d/1p8gX5AvQPmiB30PWr31AyDvhleHBpQGj/view?usp=sharing",
    "description": "In the 'Business Process Analysis & Solutioning' course, this project focused on optimizing the business processes of a local funeral service provider. A thorough analysis using As-Is/To-Be Process Workflow Models and Root Cause Analysis is conducted, identifying key inefficiencies in document management and logistical tracking. A Solution Overview Model was developed, proposing the implementation of a Customer Relationship Management (CRM) system for streamlined operations, a Logistics Management System (LMS) for better asset management, and technologies used to prevent body mix-ups. These solutions, detailed in the Business Model Canvas, aimed to enhance operational efficiency and improve the overall customer experience.",
    "icons": []
  }
]
